---
kind: property
id: P:Autodesk.Revit.UI.DockablePaneState.DockPosition
source: html/3d87dd54-a970-c09b-c113-d2e700cd2f0f.htm
---
# Autodesk.Revit.UI.DockablePaneState.DockPosition Property

Which part of the Revit application frame the pane should dock to.

## Syntax (C#)
```csharp
public DockPosition DockPosition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration